[{
  "img": "img/comingsoon.png",
  "title": "Coming Soon",
  "timeline": "TBD",
  "description": "Keep up to date with this website for future projects and tech-related endeavors!",
  "button": "More info coming soon",
  "modal_html": "<p><br>Keep up to date with this website for future projects and tech-related endeavors!</p>",
  "modal_links": "<p class='text-center'><a href='https://www.linkedin.com/in/adamfleishaker' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-linkedin pr-2'></i>LinkedIn</a></p><p class='text-center'><a href='https://github.com/afleishaker' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-git pr-2'></i>GitHub</a></p>"
},
  {
    "img": "img/dss.png",
    "title": "Disney Streaming",
    "timeline": "Summer 2019, Summer 2020",
    "description": "My 2019 summer internship was in New York at Disney Streaming Services where I automated regression testing of media with MovieLabs, utilizing TestNG & Spring for a testing framework and API, and Jenkins and Ansible for creating automation pipelines and playbooks.",
    "button": "Read more",
    "modal_html": "<p><br>At Disney Streaming Services in my 2019 summer internship, I did the following:<ul><li>Automated regression testing of media utilizing MovieLabs, TestNG for a suite-based testing framework, and Spring for an auxiliary API.</li><li>Integrated test result reporting to Slack and test visualization software.</li><li>Created Jenkins parameterized pipelines with Groovy and Ansible playbooks for deployment of the API and invocation of the testing framework.</li><li>Analyzed various tools for improving testing, including SonarQube for analysis of unit and integration tests, code coverage, and vulnerabilities.</li><li>Standardized our team's testing conventions and philosophy.</li></ul></p>",
    "modal_links": "<p class='text-center'><a href='http://disneystreaming.com' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-link pr-2'></i>Read about Disney Streaming Services</a></p>"
  },
  {
    "img": "img/perlmutter.gif",
    "title": "Perlmutter Fellowship",
    "timeline": "Summer 2020",
    "description": "In late April, I began working under Prof. Gene Miller to develop solutions for non-profits in the post-COVID environment. Perlmutter App is a communication framework allowing non-profits to interface with constituents via web-app, phone, and/or email, in a unified format.",
    "button": "Read more",
    "modal_html": "<p><br>In late April, I began working under <a href='https://www.brandeis.edu/facultyguide/person.html?emplid=a17250782cc27b6ced397bc3c9310b5f32e03d34'>Prof. Gene Miller</a> of the Brandeis International Business School alongside <a href='https://github.com/mdodell'>Mitchell Dodell</a> and <a href='https://www.linkedin.com/in/daniel-khudyak/'>Daniel Khudyak</a> to develop solutions for non-profits in the post-COVID environment. Perlmutter App is a communication framework allowing non-profits to interface with constituents via web-app, phone, and/or email, in a unified format.\n<br><br>Organizations can send events, information, and messages as admins to users via call, text, email, or in-app newsletter.\n\nOur primary client is <a href='https://havenproject.net/'>The Haven Project</a>, an impactful organization started to address a gap in services to unaccompanied homeless young adults and surrounding communities. They provide direct service to more than 200 homeless unaccompanied youth ages 17-24 each year in their Drop-in Centers, with referrals to other youth serving organizations for hundreds more who don’t meet intake criteria.<br><br>I was responsible for Rails back-end work, with Mitchell handling the front-end, and Daniel facilitating as PM.<br></p>",
    "modal_links": "<p class='text-center'><a href='https://github.com/mdodell/PerlmutterSummer2020' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-git pr-2'></i>View on GitHub</a></p>"
  },
  {
    "img": "img/groupus.png",
    "title": "GroupUs",
    "timeline": "Spring 2019",
    "description": "GroupUs is a modular group registration web application developed as part of an Independent Study at Brandeis University.",
    "button": "Read more",
    "modal_html": "<p><br>GroupUs is a modular group registration web application developed with the MERN stack. Initially developed as a commission for an Interact District Conference, myself and the initial co-developer <a href='https://github.com/mdodell'>Mitchell Dodell</a> teamed up with  <a href='https://github.com/rrmatthews'>R Matthews</a> to iterate upon it in an Independent Study under Prof. Hickey at Brandeis.<br><br>I was responsible for Mongo, Express, and Node back-end work, with Mitchell handling React/Redux on the front-end, and R facilitating as PM. <br></p>",
    "modal_links": "<p class='text-center'><a href='https://github.com/mdodell/GroupUs' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-git pr-2'></i>View on GitHub</a></p>"
  },
  {
    "img": "img/planneasy.png",
    "title": "Planneasy",
    "timeline": "Summer 2018",
    "description": "A rewrite of an old project from 2017, Planneasy is a material design, to-do list/planner for education & daily use. This version, however, is a Chrome extension and Android app, syncing notes between both!",
    "button": "Read more",
    "modal_html": "<p><br>A material design, to-do list/planner for education & daily use. This is a rewrite of an old project which I completed for senior options in high school.<br><br> This new version has two releases: an Android app and a Chrome extension, allowing for users to sync and maintain notes between devices. The focus of the application has also changed from longer form multimedia embeds to shorter notes. It utilizes Firebase for data storage and persistence.<br><br></p>",
    "modal_links": "<p class='text-center'><a href='https://play.google.com/store/apps/details?id=me.adamfly.planneasy' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-mobile pr-2'></i>Download on the Play Store (<span>Android</span>)</a></p><p class='text-center'><a itemprop='url' href='https://chrome.google.com/webstore/detail/planneasy/lckndamfagnfenbnlkahlciknibjcnph' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-display pr-2'></i>Install on the Chrome Web Store (<span itemprop='operatingSystem'>Chrome Extension</span>)</a></p>"
  },
  {
    "img": "img/apptopia.png",
    "title": "Apptopia",
    "timeline": "Summer 2018",
    "description": "My 2018 summer internship was in Boston at Apptopia, where I developed integrations and public interaces to Apptopia's data with Python, Flask, Pandas, JS, Google Apps Script, MongoDB, and Redshift, as well as utilizing multiple RESTful APIs including Slack.",
    "button": "Read more",
    "modal_html": "<p>Apptopia for Chrome is one of three public interfaces/integrations of Apptopia's data that I created this summer as part of my internship. \nOver the course of the internship, I developed Apptopia for Chrome, Slack, and Sheets, integrations allowing Apptopia customers to access app and publisher data within the comfort of their browser/workspace/data sources. \nIt displays apps or publishers via the website URL you visit in the case of Chrome, or information provided in the case of Sheets and Slack.<br><br> Data points accessible in the integration include MAUs, DAUs, downloads, total app revenue, and store rank. Data points are ranged or precise estimates depending upon the company's Apptopia subscription. The integration was made using JS for the extension (Chrome and Sheets), and Python, Flask, MongoDB and Pandas for the endpoints.\n<br><br>I also was responsible for the creation of assets and graphics to market the integrations, and day-to-day data requests from clients using Apptopia's API.</p>",
    "modal_links": "<p class='text-center'><a href='https://blog.apptopia.com/uncover-details-on-any-app-right-from-google-chrome' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-news pr-2'></i>Read the blog post on Apptopia for Chrome</a></p><p class='text-center'><a href='https://blog.apptopia.com/why-we-built-a-slack-app' class='btn btn-outline-dark btn-lg text-dark' role='button'><i class='icon-news pr-2'></i>Read the blog post on Apptopia for Slack</a></p>"
  }]